backend.backup.20251219_151723/app/Models/BusinessSetting.php

    protected static function boot()
    {
        parent::boot();
        static::saved(function ($model) {
             Helpers::deleteCacheData('business_settings_all_data');
            $value = Helpers::getDisk();

            DB::table('storages')->updateOrInsert(
                [
                    'data_type' => get_class($model),
                    'data_id' => $model->id,
                    'key' => 'disk',
                ],
                [
                    'value' => $value,
                    'created_at' => now(),
                    'updated_at' => now(),
                ]
            );
---
update `storages` set `value` = 'public', `created_at` = '2025-12-10 13:05:42', `updated_at` = '2025-12-10 13:05:42' where (`data_type` = 'App\\Models\\BusinessSetting' and `data_id` = 4 and `key` = 'disk') limit 1