backend.backup.20251219_151723/app/Models/Store.php

update `stores` set `status` = 0, `pos_system` = 1, `self_delivery_system` = 1, `reviews_section` = 1, `free_delivery` = 0, `store_business_model` = 'unsubscribed', `stores`.`updated_at` = '2025-12-10 13:05:42' where exists (select * from `store_subscriptions` where `stores`.`id` = `store_subscriptions`.`store_id` and `status` = 1 and date(`expiry_date`) <= '2025-12-10')
update `store_subscriptions` set `status` = 0, `store_subscriptions`.`updated_at` = '2025-12-10 13:05:42' where `status` = 1 and date(`expiry_date`) <= '2025-12-10'
---
    protected static function booted(): void
    {
        static::addGlobalScope(new ZoneScope);

        static::addGlobalScope('translate', function (Builder $builder) {
            $builder->with(['translations' => function($query){
                return $query->where('locale', app()->getLocale());
            }]);
        });

        static::addGlobalScope('storage', function ($builder) {
            $builder->with('storage');
        });

        static::retrieved(function () {
            // Helpers::disableStoreForOrderCancellation();
            $current_date = date('Y-m-d');
            $check_daily_subscription_validity_check=  Helpers::getSettingsDataFromConfig(settings: 'check_daily_subscription_validity_check');
            if(!$check_daily_subscription_validity_check){
                Helpers::insert_business_settings_key('check_daily_subscription_validity_check', $current_date);
                $check_daily_subscription_validity_check= BusinessSetting::where('key', 'check_daily_subscription_validity_check')->first();
            }

            if($check_daily_subscription_validity_check && $check_daily_subscription_validity_check?->value != $current_date){

                Store::whereHas('store_subs',function ($query)use($current_date){
                    $query->where('status',1)->whereDate('expiry_date', '<=', $current_date);
                })->update(['status' => 0,
                            'pos_system'=>1,
                            'self_delivery_system'=>1,
                            'reviews_section'=>1,
                            'free_delivery'=>0,
                            'store_business_model'=>'unsubscribed',
                            ]);
                StoreSubscription::where('status',1)->whereDate('expiry_date', '<=', $current_date)->update([
                    'status' => 0
                ]);