backend.backup.20251219_151723/app/Http/Controllers/Api/V1/ConfigController.php

    function __construct()
    {
        $map_api_key_server = BusinessSetting::where(['key' => 'map_api_key_server'])->first();
---
select * from `business_settings` where (`key` = 'map_api_key_server') limit 1


        if(addon_published_status('Rental')){
            $cache_dis_key_min = "vehicle_dis_min_price_conf";
            $vehicle_distance_min = Cache::rememberForever($cache_dis_key_min, function () {
                return Vehicle::where('distance_price' ,'>','0')->min('distance_price');
            });
            $cache_hour_key_min = "vehicle_hour_min_price_conf";
            $vehicle_hourly_min = Cache::rememberForever($cache_hour_key_min, function () {
                return Vehicle::where('hourly_price' ,'>','0')->min('hourly_price');
            });
---
select min(`distance_price`) as aggregate from `vehicles` where `distance_price` > '0'
select min(`hourly_price`) as aggregate from `vehicles` where `hourly_price` > '0'

                }
        }
        if(addon_published_status('TaxModule')){
          $systemTax=  \Modules\TaxModule\Entities\SystemTaxSetup::where('is_active', 1)->where('is_default', 1)->first();
---
select * from `system_tax_setups` where `is_active` = 1 and `is_default` = 1 limit 1

            'vehicle_hourly_min' => (float) $vehicle_hourly_min?? 0,
            'vehicle_day_wise_min' => (float) $vehicle_day_wise_min?? 0,
            'admin_free_delivery' =>$admin_free_delivery,
            'is_sms_active' =>  (boolean) (Schema::hasTable('addon_settings') && Setting::whereJsonContains('live_values->status','1')->where('settings_type', 'sms_config')->exists()),
---
select exists(select * from `addon_settings` where json_contains(`live_values`, '\"1\"', '$."status"') and `settings_type` = 'sms_config') as `exists`

    public static function get_settings_status($name)
    {
        $data = Cache::rememberForever('data_settings_' . $name, function () use ($name) {
            return DataSetting::where('key', $name)->value('value');
        });
---
select `value` from `data_settings` where `key` = 'refund_policy_status' limit 1

    public function react_landing_page()
    {
        $datas = DataSetting::with('translations')->whereIn('type', ['react_landing_page' ,'module_home_page_data','module_vendor_registration_data'])->get();
---
select * from `data_settings` where `type` in ('react_landing_page', 'module_home_page_data', 'module_vendor_registration_data')

            }
        }

        $reviews = ReactTestimonial::get();
---
select * from `react_testimonials`

            }
        }

        $zones= Zone::where('status',1)->get();
---
select * from `zones` where `status` = 1