backend.backup.20251219_151723/Modules/BeautyBooking/Http/Controllers/Api/Customer/BeautyDashboardController.php

    public function summary(Request $request): JsonResponse
    {
        $user = $request->user();

        // Total bookings count
        // تعداد کل رزروها
        $totalBookings = $this->booking->where('user_id', $user->id)->count();

        // Upcoming bookings count
        // تعداد رزروهای آینده
        $upcomingBookings = $this->booking->where('user_id', $user->id)
            ->upcoming()
            ->count();

        // Total spent (sum of paid/completed bookings)
        // کل هزینه (مجموع رزروهای پرداخت شده/تکمیل شده)
        $totalSpent = $this->booking->where('user_id', $user->id)
            ->whereIn('status', ['completed', 'confirmed'])
            ->whereIn('payment_status', ['paid', 'partially_paid'])
            ->sum('total_amount');

        // Active packages count
        // تعداد پکیج‌های فعال
        $activePackages = BeautyPackageUsage::where('user_id', $user->id)
            ->where('status', 'pending')
            ->whereHas('package', function($q) {
                $q->where('status', 1);
            })
            ->distinct('package_id')
            ->count();
---
select count(distinct `package_id`) as aggregate from `beauty_package_usages` where `user_id` = 5005 and `status` = 'pending' and exists (select * from `beauty_packages` where `beauty_package_usages`.`package_id` = `beauty_packages`.`id` and `status` = 1 and `beauty_packages`.`deleted_at` is null)


        // Gift card balance (sum of active gift cards)
        // موجودی کارت هدیه (مجموع کارت‌های هدیه فعال)
        $giftCardBalance = BeautyGiftCard::where('purchased_by', $user->id)
            ->where('status', 'active')
            ->where(function($q) {
                $q->whereNull('expires_at')
                  ->orWhere('expires_at', '>', now());
            })
            ->sum('amount');
---
select sum(`amount`) as aggregate from `beauty_gift_cards` where `purchased_by` = 5005 and `status` = 'active' and (`expires_at` is null or `expires_at` > '2025-12-10 15:16:16')

            ->earned()
            ->sum('points');

        $usedPointsRaw = BeautyLoyaltyPoint::where('user_id', $user->id)
            ->where('type', 'redeemed')
            ->sum('points');
---
select sum(`points`) as aggregate from `beauty_loyalty_points` where `user_id` = 5005 and `type` = 'redeemed'