backend.backup.20251219_151723/Modules/BeautyBooking/Http/Controllers/Api/Customer/BeautySalonController.php


            // Eager load relationships to prevent N+1 queries
            // بارگذاری eager روابط برای جلوگیری از N+1 queries
            $salons->load(['store', 'badges']);
---
select * from `stores` where `stores`.`id` in (13, 14, 17, 18, 19, 20, 21)