backend.backup.20251219_151723/Modules/BeautyBooking/Http/Controllers/Api/Customer/BeautyBookingController.php

select * from `beauty_services` where `beauty_services`.`id` = 36 and `beauty_services`.`deleted_at` is null limit 1
---
    public function getServiceSuggestions(Request $request, int $id): JsonResponse
    {
        $validator = Validator::make($request->all(), [
            'salon_id' => 'nullable|integer|exists:beauty_salons,id',
        ]);

        if ($validator->fails()) {
            return $this->validationErrorResponse($validator);
        }

        try {
            $service = BeautyService::findOrFail($id);

select * from `beauty_services` where `beauty_services`.`id` = 40 and `beauty_services`.`deleted_at` is null limit 1
---
    public function checkAvailability(Request $request): JsonResponse
    {
        $validator = Validator::make($request->all(), [
            'salon_id' => 'required|integer|exists:beauty_salons,id',
            'service_id' => 'required|integer|exists:beauty_services,id',
            'date' => 'required|date|after_or_equal:today',
            'staff_id' => 'nullable|integer|exists:beauty_staff,id',
        ]);

        if ($validator->fails()) {
            return $this->validationErrorResponse($validator);
        }

        $service = BeautyService::findOrFail($request->service_id);

select * from `stores` where `stores`.`id` in (14)
select * from `stores` where `stores`.`id` in (13, 14, 17)
---
    public function index(Request $request): JsonResponse
    {
        $limit = $request->get('per_page', $request->get('limit', 25));
        $offset = $request->get('offset', 0);
        $serviceId = $request->get('service_id', $request->get('service_type'));
        $dateRange = $this->parseDateRange($request->get('date_range'));

        // Calculate page number from offset
        // محاسبه شماره صفحه از offset
        // Fixed: paginate() expects page number (1, 2, 3...), not offset
        // اصلاح شده: paginate() شماره صفحه را انتظار دارد (1, 2, 3...)، نه offset
        $page = $offset > 0 ? max(1, (int)floor($offset / $limit) + 1) : 1;

        $bookings = $this->booking->where('user_id', $request->user()->id)
            ->with(['salon.store', 'service', 'staff'])
            ->when($request->filled('status'), function ($query) use ($request) {
                $query->where('status', $request->status);
            })
            ->when($request->filled('type'), function ($query) use ($request) {
                if ($request->type === 'upcoming') {
                    $query->upcoming();
                } elseif ($request->type === 'past') {
                    $query->past();
                } elseif ($request->type === 'cancelled') {
                    $query->where('status', 'cancelled');
                }
            })
            ->when($serviceId, function ($query) use ($serviceId) {
                $query->where('service_id', $serviceId);
            })
            ->when($request->filled('staff_id'), function ($query) use ($request) {
                $query->where('staff_id', $request->staff_id);
            })
            ->when($request->filled('date_from'), function ($query) use ($request) {
                $query->whereDate('booking_date', '>=', $request->date_from);
            })
            ->when($request->filled('date_to'), function ($query) use ($request) {
                $query->whereDate('booking_date', '<=', $request->date_to);
            })
            ->when($dateRange, function ($query) use ($dateRange) {
                [$fromDate, $toDate] = $dateRange;
                $query->whereDate('booking_date', '>=', $fromDate)
                    ->whereDate('booking_date', '<=', $toDate);
            })
            ->latest()
            ->paginate($limit, ['*'], 'page', $page);

select * from `conversations` where `conversations`.`id` in (1)
select * from `stores` where `stores`.`id` in (17)
---
    public function show(int $id, Request $request): JsonResponse
    {
        $booking = $this->booking->where('user_id', $request->user()->id)
            ->with(['salon.store', 'service', 'staff', 'review', 'conversation'])
            ->findOrFail($id);

select * from `messages` where `messages`.`conversation_id` in (1) order by `created_at` asc
select * from `conversations` where `conversations`.`id` = 1 limit 1
---
    public function getConversation(Request $request, int $id): JsonResponse
    {
        $booking = $this->booking->where('user_id', $request->user()->id)
            ->findOrFail($id);

        // Authorization check
        // بررسی مجوز
        $this->authorizeBookingOwnership($booking, $request->user()->id);

        if (!$booking->conversation_id) {
            return $this->errorResponse([
                ['code' => 'conversation', 'message' => translate('messages.conversation_not_found')],
            ], 404);
        }

        $conversation = \App\Models\Conversation::with(['messages' => function($q) {
            $q->orderBy('created_at', 'asc'); // Order messages ascending
        }, 'sender', 'receiver'])
            ->findOrFail($booking->conversation_id);

        return $this->successResponse('messages.data_retrieved_successfully', [
            'conversation_id' => $conversation->id,
            'messages' => $conversation->messages->map(function ($message) {
                $fileData = null;
                if ($message->file) {
                    if (is_string($message->file)) {
                        $fileData = json_decode($message->file, true);
                    } else {
                        $fileData = $message->file;
                    }
                }

                return [
                    'id' => $message->id,
                    'sender_id' => $message->sender_id,
                    'message' => $message->message,
                    'file' => $fileData,
                    'file_url' => $message->file_full_url ?? null,
                    'sender_type' => 'customer', // Customer is always sender in this context
                    'created_at' => $message->created_at->format('Y-m-d H:i:s'),
                ];