backend.backup.20251219_151723/Modules/BeautyBooking/Http/Controllers/Api/Customer/BeautyLoyaltyController.php

    public function getPoints(Request $request)
    {
        $user = $request->user();

        $totalPoints = (float) BeautyLoyaltyPoint::where('user_id', $user->id)
            ->valid()
            ->earned()
            ->sum('points');

        $usedPointsRaw = BeautyLoyaltyPoint::where('user_id', $user->id)
            ->where('type', 'redeemed')
            ->sum('points');
---
select sum(`points`) as aggregate from `beauty_loyalty_points` where `user_id` = 5005 and `type` = 'redeemed'

    public function getCampaigns(Request $request)
    {
        $limit = $request->get('per_page', $request->get('limit', 25));
        $offset = $request->get('offset', 0);

        // Calculate page number from offset
        // محاسبه شماره صفحه از offset
        $page = $offset > 0 ? max(1, (int)floor($offset / $limit) + 1) : 1;

        $campaigns = BeautyLoyaltyCampaign::with(['salon.store'])
            ->active() // Use scopeActive() which properly checks is_active boolean and handles null end_date
            ->when($request->filled('salon_id'), function ($query) use ($request) {
                $query->where('salon_id', $request->salon_id);
            })
            ->paginate($limit, ['*'], 'page', $page);

        $formatted = $campaigns->getCollection()->map(function ($campaign) {
            return [
                'id' => $campaign->id,
                'name' => $campaign->name,
                'description' => $campaign->description,
                'type' => $campaign->type,
                'rules' => $campaign->rules,
                'start_date' => $campaign->start_date ? $campaign->start_date->format('Y-m-d') : null,
                'end_date' => $campaign->end_date ? $campaign->end_date->format('Y-m-d') : null,
                'salon' => $campaign->salon ? [
                    'id' => $campaign->salon->id,
                    'name' => $campaign->salon->store?->name ?? '',
                ] : null,
                'is_active' => $campaign->isActive(),
            ];
        });
---
select * from `stores` where `stores`.`id` in (13, 14)
select * from `beauty_loyalty_campaigns` where `is_active` = 1 and `start_date` <= '2025-12-10 15:23:49' and (`end_date` is null or `end_date` >= '2025-12-10 15:23:49') and `beauty_loyalty_campaigns`.`deleted_at` is null limit 6 offset 0