backend.backup.20251219_151723/Modules/BeautyBooking/Services/BeautyCrossSellingService.php

select * from `beauty_services` where `beauty_services`.`id` = 36 and `beauty_services`.`deleted_at` is null limit 1
select * from `beauty_service_relations` where `service_id` = 36 and `status` = 1 order by `priority` desc
---
    public function getSuggestedServices(int $serviceId, ?int $userId = null, ?int $salonId = null)
    {
        $service = BeautyService::findOrFail($serviceId);
        $maxSuggestions = config('beautybooking.cross_selling.max_suggestions', 5);

        // Get explicit relations defined by vendor
        // دریافت روابط صریح تعریف شده توسط فروشنده
        $explicitRelations = BeautyServiceRelation::where('service_id', $serviceId)
            ->where('status', 1)
            ->with('relatedService')
            ->orderByDesc('priority')
            ->get()
            ->map(function($relation) {
                $relatedService = $relation->relatedService;
                if (!$relatedService || !$relatedService->status) {
                    return null;
                }

                return [
                    'service' => $relatedService,
                    'relation_type' => $relation->relation_type,
                    'priority' => $relation->priority,
                    'source' => 'explicit',
                ];
            })
            ->filter()
            ->take($maxSuggestions);

select `b2`.`service_id`, COUNT(*) as booking_count from `beauty_bookings` as `b1` inner join `beauty_bookings` as `b2` on `b1`.`user_id` = `b2`.`user_id` and `b1`.`service_id` = 36 and `b2`.`service_id` != 36 and `b1`.`user_id` != 5005 where `b2`.`status` != 'cancelled' and `b2`.`created_at` >= '2025-09-11 14:00:15' group by `b2`.`service_id` order by `booking_count` desc limit 5
---
    private function getPersonalizedSuggestions(int $serviceId, int $userId, ?int $salonId, int $limit)
    {
        // Find services that users who booked this service also booked
        // یافتن خدماتی که کاربرانی که این خدمت را رزرو کرده‌اند نیز رزرو کرده‌اند
        $relatedServiceIds = DB::table('beauty_bookings as b1')
            ->join('beauty_bookings as b2', function($join) use ($serviceId, $userId) {
                $join->on('b1.user_id', '=', 'b2.user_id')
                     ->where('b1.service_id', '=', $serviceId)
                     ->where('b2.service_id', '!=', $serviceId)
                     ->where('b1.user_id', '!=', $userId); // Exclude current user
            })
            ->where('b2.status', '!=', 'cancelled')
            ->where('b2.created_at', '>=', now()->subDays(90))
            ->select('b2.service_id')
            ->selectRaw('COUNT(*) as booking_count')
            ->groupBy('b2.service_id')
            ->orderByDesc('booking_count')
            ->limit($limit)
            ->pluck('b2.service_id');