backend.backup.20251219_151723/Modules/BeautyBooking/Services/BeautyCalendarService.php

    public function getWorkingHours(int $salonId, ?int $staffId, string $date): ?array
    {
        // If staff is specified, use staff working hours, otherwise use salon hours
        // اگر کارمند مشخص شده باشد، از ساعات کاری کارمند استفاده کنید، در غیر این صورت از ساعات سالن استفاده کنید
        if ($staffId) {
            $staff = BeautyStaff::findOrFail($staffId);
---
select * from `beauty_staff` where `beauty_staff`.`id` = 25 and `beauty_staff`.`deleted_at` is null limit 1

    public function isHoliday(int $salonId, string $date): bool
    {
        $salon = BeautySalon::findOrFail($salonId);
---
select * from `beauty_salons` where `beauty_salons`.`id` = 20 and `beauty_salons`.`deleted_at` is null limit 1

    private function isStaffAvailable(int $staffId, string $date, string $time, int $durationMinutes): bool
    {
        try {
            $staff = BeautyStaff::findOrFail($staffId);
---
select * from `beauty_staff` where `beauty_staff`.`id` = 25 and `beauty_staff`.`deleted_at` is null limit 1

    private function hasCalendarBlock(int $salonId, ?int $staffId, string $date, string $time, int $durationMinutes): bool
    {
        $endTime = Carbon::parse($date . ' ' . $time)->addMinutes($durationMinutes)->format('H:i:s');

        $query = BeautyCalendarBlock::where('salon_id', $salonId)
            ->where('date', $date)
            ->where(function($q) use ($staffId) {
                $q->whereNull('staff_id')
                  ->orWhere('staff_id', $staffId);
            })
            ->where(function($q) use ($time, $endTime) {
                // Check if booking time overlaps with any block
                // بررسی همپوشانی زمان رزرو با بلاک‌ها
                $q->where(function($q2) use ($time, $endTime) {
                    $q2->whereBetween('start_time', [$time, $endTime])
                       ->orWhereBetween('end_time', [$time, $endTime])
                       ->orWhere(function($q3) use ($time, $endTime) {
                           $q3->where('start_time', '<=', $time)
                              ->where('end_time', '>=', $endTime);
                       });
                });
            });

        return $query->exists();
---
select exists(select * from `beauty_calendar_blocks` where `salon_id` = 20 and `date` = '2025-12-17' and (`staff_id` is null or `staff_id` = 25) and ((`start_time` between '09:00' and '10:00:00' or `end_time` between '09:00' and '10:00:00' or (`start_time` <= '09:00' and `end_time` >= '10:00:00')))) as `exists`