backend.backup.20251219_151723/Modules/BeautyBooking/Services/BeautyRankingService.php

select count(*) as aggregate from `beauty_bookings` where `salon_id` = 12 and `booking_date` >= '2025-11-10 13:52:15' and `status` != 'cancelled' and `beauty_bookings`.`deleted_at` is null
---
    private function calculateActivityScore(BeautySalon $salon): float
    {
        $activityConfig = config('beautybooking.ranking.activity', []);
        $days = $activityConfig['days'] ?? 30;
        $maxBookings = $activityConfig['max_bookings'] ?? 50;

        $recentBookings = BeautyBooking::where('salon_id', $salon->id)
            ->where('booking_date', '>=', Carbon::now()->subDays($days))
            ->where('status', '!=', 'cancelled')
            ->count();

select count(*) as aggregate from `beauty_bookings` where `salon_id` = 12 and `status` != 'cancelled' and `beauty_bookings`.`deleted_at` is null
---
    private function calculateReturningRateScore(BeautySalon $salon): float
    {
        $returningConfig = config('beautybooking.ranking.returning_rate', []);
        $expectedRate = $returningConfig['expected_rate'] ?? 0.3;

        $totalBookings = BeautyBooking::where('salon_id', $salon->id)
            ->where('status', '!=', 'cancelled')
            ->count();

select * from `beauty_services` where `salon_id` = 12 and `status` = 'active' and `beauty_services`.`deleted_at` is null
---
    private function calculateAvailabilityScore(BeautySalon $salon): float
    {
        try {
            // Get all services for this salon to determine average duration
            // دریافت تمام خدمات این سالن برای تعیین مدت زمان متوسط
            $services = BeautyService::where('salon_id', $salon->id)
                ->where('status', 'active')
                ->get();